voiceguard/Vulnerability Test Results/jmeter-test-plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="VoiceGuard API Load Test" enabled="true">
      <stringProp name="TestPlan.comments">VoiceGuard API load test plan (Phase 7). Mirrors the same traffic mix and
        rate-limit-bypass-for-testing technique documented in k6-load-test.js and
        artillery-load-test.yml — see performance-report.md for the real, executed
        baseline results (measured via the k6 script). Requires load-test users
        seeded first via performance/seed_users.py.</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BASE_HOST" elementType="Argument">
            <stringProp name="Argument.name">BASE_HOST</stringProp>
            <stringProp name="Argument.value">${__P(BASE_HOST,localhost)}</stringProp>
          </elementProp>
          <elementProp name="BASE_PORT" elementType="Argument">
            <stringProp name="Argument.name">BASE_PORT</stringProp>
            <stringProp name="Argument.value">${__P(BASE_PORT,8000)}</stringProp>
          </elementProp>
          <elementProp name="THREADS" elementType="Argument">
            <stringProp name="Argument.name">THREADS</stringProp>
            <stringProp name="Argument.value">${__P(THREADS,100)}</stringProp>
          </elementProp>
          <elementProp name="RAMP_SECONDS" elementType="Argument">
            <stringProp name="Argument.name">RAMP_SECONDS</stringProp>
            <stringProp name="Argument.value">${__P(RAMP_SECONDS,10)}</stringProp>
          </elementProp>
          <elementProp name="DURATION_SECONDS" elementType="Argument">
            <stringProp name="Argument.name">DURATION_SECONDS</stringProp>
            <stringProp name="Argument.value">${__P(DURATION_SECONDS,60)}</stringProp>
          </elementProp>
          <elementProp name="LOAD_PASSWORD" elementType="Argument">
            <stringProp name="Argument.name">LOAD_PASSWORD</stringProp>
            <stringProp name="Argument.value">LoadTest!2345</stringProp>
          </elementProp>
          <elementProp name="SEEDED_USER_COUNT" elementType="Argument">
            <stringProp name="Argument.name">SEEDED_USER_COUNT</stringProp>
            <stringProp name="Argument.value">120</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <CookieManager guiclass="CookiePanel" testclass="CookieManager" testname="HTTP Cookie Manager" enabled="true">
        <collectionProp name="CookieManager.cookies"/>
        <boolProp name="CookieManager.clearEachIteration">false</boolProp>
        <stringProp name="CookieManager.policy">standard</stringProp>
        <boolProp name="CookieManager.controlledByThreadGroup">false</boolProp>
      </CookieManager>
      <hashTree/>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
        <stringProp name="HTTPSampler.domain">${BASE_HOST}</stringProp>
        <stringProp name="HTTPSampler.port">${BASE_PORT}</stringProp>
        <stringProp name="HTTPSampler.protocol">http</stringProp>
        <stringProp name="HTTPSampler.connect_timeout">5000</stringProp>
        <stringProp name="HTTPSampler.response_timeout">30000</stringProp>
      </ConfigTestElement>
      <hashTree/>

      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Baseline Load (100 VUs / 1 min)" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${THREADS}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${RAMP_SECONDS}</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${DURATION_SECONDS}</stringProp>
      </ThreadGroup>
      <hashTree>
        <!-- NOTE: this app rate-limits login per source IP
             (RATE_LIMIT_LOGIN_PER_HOUR_PER_IP=10) and, as of the F-14 fix in
             security-review.md, that can no longer be bypassed via a spoofed
             X-Forwarded-For header (the app now only trusts that header from
             an explicitly configured trusted-proxy IP). To run this plan
             with THREADS > 10 against a single backend instance, raise the
             limit for the test run instead:
               RATE_LIMIT_LOGIN_PER_HOUR_PER_IP=200 docker compose up -d backend -->

        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Compute seeded username for this thread" enabled="true">
          <stringProp name="script">int idx = (ctx.getThreadNum()) % Integer.parseInt(vars.get("SEEDED_USER_COUNT"));
vars.put("loadEmail", String.format("loadtest_user%03d@example.com", idx));</stringProp>
          <stringProp name="scriptLanguage">groovy</stringProp>
        </JSR223PreProcessor>
        <hashTree/>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/v1/auth/login" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"email":"${loadEmail}","password":"${LOAD_PASSWORD}"}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">/api/v1/auth/login</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Content-Type: application/json" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 200 OK" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

        <ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="40%: List Scans / Dashboard" enabled="true">
          <intProp name="ThroughputController.style">1</intProp>
          <boolProp name="ThroughputController.perThread">false</boolProp>
          <FloatProperty><name>ThroughputController.percentThroughput</name><value>40.0</value></FloatProperty>
        </ThroughputController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /api/v1/scans" enabled="true">
            <stringProp name="HTTPSampler.path">/api/v1/scans?page=1&amp;page_size=20</stringProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
          </HTTPSamplerProxy>
          <hashTree/>
        </hashTree>

        <ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="25%: Profile" enabled="true">
          <intProp name="ThroughputController.style">1</intProp>
          <boolProp name="ThroughputController.perThread">false</boolProp>
          <FloatProperty><name>ThroughputController.percentThroughput</name><value>25.0</value></FloatProperty>
        </ThroughputController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /api/v1/user/profile" enabled="true">
            <stringProp name="HTTPSampler.path">/api/v1/user/profile</stringProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
          </HTTPSamplerProxy>
          <hashTree/>
        </hashTree>

        <ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="20%: Dashboard" enabled="true">
          <intProp name="ThroughputController.style">1</intProp>
          <boolProp name="ThroughputController.perThread">false</boolProp>
          <FloatProperty><name>ThroughputController.percentThroughput</name><value>20.0</value></FloatProperty>
        </ThroughputController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /api/v1/dashboard" enabled="true">
            <stringProp name="HTTPSampler.path">/api/v1/dashboard</stringProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
          </HTTPSamplerProxy>
          <hashTree/>
        </hashTree>

        <ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="15%: Upload Scan" enabled="true">
          <intProp name="ThroughputController.style">1</intProp>
          <boolProp name="ThroughputController.perThread">false</boolProp>
          <FloatProperty><name>ThroughputController.percentThroughput</name><value>15.0</value></FloatProperty>
        </ThroughputController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/v1/scans (upload)" enabled="true">
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">true</boolProp>
            <elementProp name="HTTPsampler.Files" elementType="HTTPFileArgs">
              <collectionProp name="HTTPFileArgs.files">
                <elementProp name="" elementType="HTTPFileArg">
                  <stringProp name="File.path">${__P(SAMPLE_WAV_PATH,./sample.wav)}</stringProp>
                  <stringProp name="File.paramname">file</stringProp>
                  <stringProp name="File.mimetype">audio/wav</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.path">/api/v1/scans</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
          </HTTPSamplerProxy>
          <hashTree>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 201 or 409 (duplicate)" enabled="true">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="49648">201</stringProp>
                <stringProp name="49650">409</stringProp>
              </collectionProp>
              <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
              <boolProp name="Assertion.assume_success">false</boolProp>
              <intProp name="Assertion.test_type">2</intProp>
            </ResponseAssertion>
            <hashTree/>
          </hashTree>
        </hashTree>

        <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Think Time (0.5-1.5s)" enabled="true">
          <stringProp name="ConstantTimer.delay">500</stringProp>
          <stringProp name="RandomTimer.range">1000</stringProp>
        </UniformRandomTimer>
        <hashTree/>
      </hashTree>

      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">jmeter_results.jtl</stringProp>
      </ResultCollector>
      <hashTree/>

      <ResultCollector guiclass="AggregateReport" testclass="ResultCollector" testname="Aggregate Report (RPS / avg / min / max / p90 / p95 / p99 / error%)" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">jmeter_aggregate.jtl</stringProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>
